---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairstypeIsAssembledStairs
source: html/ed168ac8-d71b-10cc-1189-218e6c8a96a3.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairstypeIsAssembledStairs Property

"Assembled Stair": Whether stairs is assembled

## Syntax (C#)
```csharp
public static ForgeTypeId StairstypeIsAssembledStairs { get; }
```